# Индескация списка [List indexing]
digits = [1,2,3,4,5,6,7,8,9,10]
digits2 = digits[2:5]
print(digits2)

# Вывод данных из серидины списка
sqs = [0,1,4,9,16,25,36,49,64]
print(sqs[4:7])

# Вывод с начала списка до заданного значения
sqs = [0,1,4,9,16,25,36,49,64]
print(sqs[:7])

# Вывод от заданного значения до конца списка
sqs = [0,1,4,9,16,25,36,49,64]
print(sqs[4:])

# Третий параметр индексирования это шаг
sqs = [0,1,4,9,16,25,36,49,64]
print(sqs[::2])

num = range(2,21)[::2]
for i in num:
	print(i)

sqs = 0,1,4,9,16,25,36,49,64,81
print(sqs[1::4])

# Индексация списка с конца
digits = [1,2,3,4,5,6,7,8,9,10]
digits2 = digits[-3]
print(digits2)

digits = [1,2,3,4,5,6,7,8,9,10]
digits2 = digits[-4:-1]
print(digits2)

# Реверсирование (разворот) списка
digits = [1,2,3,4,5,6,7,8,9,10]
digits2 = digits[::-1]
print(digits2)

sqs = 0,1,4,9,16,25,36,49,64,81
print(sqs[7:5:-1])




