# Обратный слэш отмена последующего действия 
print('Hello \'World')
# Вывод текста на новую строку 
print('Новая \nстрока')
# Многострочный текст
print('''Многострочный 
	текст''')
# Функция Print вывода на экран
print('Hello World')
# Функция Input текст запроса
input('What is your name?: ')
# Переменная Test, переменная не может начинаться с цифр и спец символов
test=10
# Знак + в функции означает конкатенация (присоединение строк)
print('one'+'plus'+'3')
# Знак * в функции означает умножение строк
print('Hello'*3)
# Удалить переменную del
test=1
del test
# Метасинтаксические переменные foo bar
foo='bar'
# Уместный оператор += -= *= /= %=
test=1
test+=1
print(test)